Repository: pcmaclk/NorthFile
Catalog: FileExplorerUI/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# SidebarNetworkEmpty
source: No items yet
zh_cn: 暂无项目

# ToolbarBackToolTip
source: Back
zh_cn: 后退

# ToolbarForwardToolTip
source: Forward
zh_cn: 前进

# ToolbarUpToolTip
source: Up
zh_cn: 上一级

# ToolbarGoToolTip
source: Refresh
zh_cn: 刷新

# ToolbarNewFileToolTip
source: New file
zh_cn: 新建文件

# ToolbarNewFolderToolTip
source: New folder
zh_cn: 新建文件夹

# ToolbarCopyToolTip
source: Copy
zh_cn: 复制

# ToolbarCutToolTip
source: Cut
zh_cn: 剪切

# ToolbarPasteToolTip
source: Paste
zh_cn: 粘贴

# ToolbarContextPrototypeToolTip
source: Context menu prototype
zh_cn: 右键菜单原型

# ToolbarBreadcrumbOverflowToolTip
source: Show hidden path segments
zh_cn: 显示隐藏的路径层级

# ToolbarAddressPlaceholder
source: Address
zh_cn: 地址

# ToolbarSearchPlaceholder
source: Search current folder
zh_cn: 搜索当前文件夹

# CommonOpen
source: Open
zh_cn: 打开

# TrayMenuExit
source: Exit
zh_cn: 退出

# CommonOpenWith
source: Open with
zh_cn: 打开方式

# CommonShare
source: Share
zh_cn: 分享

# CommonCompress
source: Compress to
zh_cn: 压缩为

# CommonArchiveActions
source: Archive
zh_cn: 压缩/解压

# CommonCompressZipAction
source: Compress to ZIP
zh_cn: 压缩为 ZIP

# CommonCreateShortcut
source: Create shortcut
zh_cn: 创建快捷方式

# ShortcutNameSuffix
source: - Shortcut
zh_cn: - 快捷方式

# CommonCopyFilePath
source: Copy file path
zh_cn: 复制文件路径

# CommonCopyFolderPath
source: Copy folder path
zh_cn: 复制文件夹路径

# CommonCopyPath
source: Copy path
zh_cn: 复制路径

# CommonSetTag
source: Set tag
zh_cn: 设置标签

# CommonProperties
source: Properties
zh_cn: 属性

# CommonOpenInNewWindow
source: Open in new window
zh_cn: 在新窗口中打开

# CommonPinToggle
source: Add to favorites / Remove from favorites
zh_cn: 添加到收藏 / 从收藏中移除

# CommonOpenInTerminal
source: Open in Terminal
zh_cn: 在终端中打开

# CommonView
source: View
zh_cn: 查看

# CommonViewDetails
source: Details
zh_cn: 详细信息

# CommonViewList
source: List
zh_cn: 列表

# CommonSortBy
source: Sort by
zh_cn: 排序方式

# CommonSortByName
source: Name
zh_cn: 名称

# CommonSortByType
source: Type
zh_cn: 类型

# CommonSortBySize
source: Size
zh_cn: 大小

# CommonSortByModifiedDate
source: Modified Date
zh_cn: 修改日期

# CommonSortAscending
source: Ascending
zh_cn: 升序

# CommonSortDescending
source: Descending
zh_cn: 降序

# CommonGroupBy
source: Group by
zh_cn: 分组方式

# CommonGroupByNone
source: None
zh_cn: 无

# CommonGroupByName
source: Name
zh_cn: 名称

# CommonGroupByType
source: Type
zh_cn: 类型

# CommonGroupByModifiedDate
source: Modified Date
zh_cn: 修改日期

# CommonUnknown
source: Unknown
zh_cn: 未知

# CommonNew
source: New
zh_cn: 新建

# CommonNewFile
source: File
zh_cn: 文件

# CommonNewFolder
source: Folder
zh_cn: 文件夹

# CommonCompressedFile
source: Compressed File
zh_cn: 压缩文件

# CommonCut
source: Cut
zh_cn: 剪切

# CommonCopy
source: Copy
zh_cn: 复制

# CommonPaste
source: Paste
zh_cn: 粘贴

# CommonRename
source: Rename
zh_cn: 重命名

# CommonDelete
source: Delete
zh_cn: 删除

# CommonRefresh
source: Refresh
zh_cn: 刷新

# SidebarPinned
source: Favorites
zh_cn: 收藏

# SidebarMyComputer
source: This PC
zh_cn: 此电脑

# SidebarCloud
source: Cloud
zh_cn: 云盘

# SidebarNetwork
source: Network
zh_cn: 网络

# SidebarTags
source: Tags
zh_cn: 标签

# SidebarDesktop
source: Desktop
zh_cn: 桌面

# SidebarDocuments
source: Documents
zh_cn: 文档

# SidebarDownloads
source: Downloads
zh_cn: 下载

# SidebarPictures
source: Pictures
zh_cn: 图片

# SidebarTagWork
source: Work
zh_cn: 工作

# SidebarTagFocus
source: Focus
zh_cn: 重点

# SidebarTagArchive
source: Archive
zh_cn: 归档

# SidebarSettingsToolTip
source: Settings
zh_cn: 设置

# ToolbarToggleLanguageToolTip
source: Switch language
zh_cn: 切换语言

# BackButtonToolTip.Content
source: Back
zh_cn: 后退

# ForwardButtonToolTip.Content
source: Forward
zh_cn: 前进

# UpButtonToolTip.Content
source: Up
zh_cn: 上一级

# LoadButtonToolTip.Content
source: Refresh
zh_cn: 刷新

# NewFileButtonToolTip.Content
source: New file
zh_cn: 新建文件

# NewFolderButtonToolTip.Content
source: New folder
zh_cn: 新建文件夹

# CopyButtonToolTip.Content
source: Copy
zh_cn: 复制

# CutButtonToolTip.Content
source: Cut
zh_cn: 剪切

# PasteButtonToolTip.Content
source: Paste
zh_cn: 粘贴

# LanguageToggleButtonToolTip.Content
source: Switch language
zh_cn: 切换语言

# OverflowBreadcrumbButtonToolTip.Content
source: Show hidden path segments
zh_cn: 显示隐藏的路径层级

# ToolTipBack
source: Back
zh_cn: 后退

# ToolTipForward
source: Forward
zh_cn: 前进

# ToolTipUp
source: Up
zh_cn: 上一级

# ToolTipRefresh
source: Refresh
zh_cn: 刷新

# ToolTipNewFile
source: New file
zh_cn: 新建文件

# ToolTipNewFolder
source: New folder
zh_cn: 新建文件夹

# ToolTipCopy
source: Copy
zh_cn: 复制

# ToolTipCut
source: Cut
zh_cn: 剪切

# ToolTipPaste
source: Paste
zh_cn: 粘贴

# ToolTipSwitchLanguage
source: Switch language
zh_cn: 切换语言

# ToolTipShowHiddenPathSegments
source: Show hidden path segments
zh_cn: 显示隐藏的路径层级

# PathTextBox.PlaceholderText
source: Address
zh_cn: 地址

# SearchTextBox.PlaceholderText
source: Search current folder
zh_cn: 搜索当前文件夹

# ColumnNameHeader
source: Name
zh_cn: 名称

# ColumnTypeHeader
source: Type
zh_cn: 类型

# ColumnSizeHeader
source: Size
zh_cn: 大小

# ColumnModifiedHeader
source: Modified date
zh_cn: 修改日期

# NameHeaderTextBlock.Text
source: Name
zh_cn: 名称

# TypeHeaderTextBlock.Text
source: Type
zh_cn: 类型

# SizeHeaderTextBlock.Text
source: Size
zh_cn: 大小

# ModifiedHeaderTextBlock.Text
source: Modified date
zh_cn: 修改日期

# ColumnTotalSizeHeader
source: Total size
zh_cn: 总大小

# ColumnFreeSpaceHeader
source: Free space
zh_cn: 可用空间

# CommandDockTitle
source: Command Dock
zh_cn: 命令面板

# CommandDockLoadMore
source: Load more
zh_cn: 加载更多

# RenamePlaceholder
source: New name
zh_cn: 新名称

# RecursiveDeleteLabel
source: Recursive delete
zh_cn: 递归删除

# DockTop
source: Top
zh_cn: 顶部

# DockRight
source: Right
zh_cn: 右侧

# DockBottom
source: Bottom
zh_cn: 底部

# CommandDockAutoHide
source: Auto hide
zh_cn: 自动隐藏

# CommandPeekButtonText
source: Commands
zh_cn: 命令

# CommandDockTitleTextBlock.Text
source: Command Dock
zh_cn: 命令面板

# RenameButton.Content
source: Rename
zh_cn: 重命名

# DeleteButton.Content
source: Delete
zh_cn: 删除

# NextButton.Content
source: Load more
zh_cn: 加载更多

# RenameTextBox.PlaceholderText
source: New name
zh_cn: 新名称

# RecursiveDeleteCheckBox.Content
source: Recursive delete
zh_cn: 递归删除

# DockTopRadioButton.Content
source: Top
zh_cn: 顶部

# DockRightRadioButton.Content
source: Right
zh_cn: 右侧

# DockBottomRadioButton.Content
source: Bottom
zh_cn: 底部

# CommandAutoHideSwitch.Header
source: Auto hide
zh_cn: 自动隐藏

# CommandPeekButton.Content
source: Commands
zh_cn: 命令

# StatusLoading
source: Loading...
zh_cn: 加载中...

# StatusTextBlock.Text
source: Loading...
zh_cn: 加载中...

# StatusCurrentFolderItems
source: {0} item(s) in the current folder
zh_cn: 当前文件夹下 {0} 个项目

# StatusDriveCount
source: {0} drive(s) in This PC
zh_cn: 此电脑下 {0} 个驱动器

# StatusLanguageSwitched
source: Language switched: {0}
zh_cn: 语言已切换为：{0}

# StatusViewChanged
source: View changed: {0}
zh_cn: 视图已切换为：{0}

# StatusSortChanged
source: Sort changed: {0}, {1}
zh_cn: 排序方式已切换为：{0}，{1}

# StatusGroupChanged
source: Group changed: {0}
zh_cn: 分组方式已切换为：{0}

# CreateKindFile
source: file
zh_cn: 文件

# CreateKindFolder
source: folder
zh_cn: 文件夹

# ErrorOpenFolderFirst
source: Open a folder first.
zh_cn: 请先打开一个文件夹。

# ErrorCurrentFolderUnavailable
source: The current folder is unavailable.
zh_cn: 当前文件夹不可用。

# OperationMove
source: Move
zh_cn: 移动

# OperationPaste
source: Paste
zh_cn: 粘贴

# StatusNewFailedOpenFolderFirst
source: Open a folder before creating a new {0}.
zh_cn: 新建{0}失败：请先打开一个文件夹。

# StatusNewFailedWithReason
source: The {0} couldn't be created: {1}
zh_cn: 新建{0}失败：{1}

# StatusRenameFailedSelectLoaded
source: Select an item first.
zh_cn: 重命名失败：请先选择一个已加载项目。

# StatusRenameFailedInvalidIndex
source: This item can't be renamed right now.
zh_cn: 重命名失败：所选索引无效。

# StatusDeleteFailedSelectLoaded
source: Select an item first.
zh_cn: 删除失败：请先选择一个已加载项目。

# StatusDeleteFailedInvalidIndex
source: This item can't be deleted right now.
zh_cn: 删除失败：所选索引无效。

# StatusDeleteCanceled
source: Delete canceled by user.
zh_cn: 已取消删除。

# StatusCopyFailedSelectLoaded
source: Select an item first.
zh_cn: 复制失败：请先选择一个已加载项目。

# StatusCutFailedSelectLoaded
source: Select an item first.
zh_cn: 剪切失败：请先选择一个已加载项目。

# StatusCopyFailedDriveRootsUnsupported
source: Drive roots can't be copied here.
zh_cn: 复制失败：暂不支持驱动器根目录。

# StatusCutFailedDriveRootsUnsupported
source: Drive roots can't be cut here.
zh_cn: 剪切失败：暂不支持驱动器根目录。

# StatusCopyReady
source: Copy ready: {0}
zh_cn: 复制就绪：{0}

# StatusCutReady
source: Cut ready: {0}
zh_cn: 剪切就绪：{0}

# StatusPasteFailedOpenFolderFirst
source: Open a folder before pasting.
zh_cn: 粘贴失败：请先打开一个文件夹。

# StatusPasteFailedWithReason
source: The items couldn't be pasted: {0}
zh_cn: 粘贴失败：{0}

# StatusPasteFailedClipboardEmpty
source: There’s nothing in the clipboard to paste.
zh_cn: 粘贴失败：剪贴板为空。

# StatusPasteSkippedConflicts
source: {0} item(s) weren't pasted because items with the same name already exist in the destination.
zh_cn: 已跳过粘贴：{0} 个目标项已存在。

# StatusPasteSkippedSamePath
source: The source and destination are the same, so nothing was pasted.
zh_cn: 已跳过粘贴：源路径和目标路径相同。

# StatusPasteSkippedNothingApplied
source: There’s nothing to paste.
zh_cn: 已跳过粘贴：没有应用任何更改。

# StatusTransferSuccess
source: {0} {1} item(s). Conflicts: {2}. Same location: {3}. Couldn't complete: {4}.
zh_cn: {0}成功：{1} 个项目，冲突 {2}，同路径 {3}，失败 {4}。

# StatusCreateSuccess
source: Created \"{0}\".
zh_cn: 创建成功：{0}

# StatusCreateFailed
source: \"{0}\" couldn't be created.
zh_cn: 创建失败：{0}

# StatusPathNotFound
source: Path not found: {0}
zh_cn: 路径不存在：{0}

# StatusNoMoreEntries
source: No more entries.
zh_cn: 没有更多项目了。

# StatusPathAccessDeniedSkip
source: Access to \"{0}\" is denied.
zh_cn: 路径：{0} | 访问被拒绝，已跳过当前目录。

# StatusPathError
source: \"{0}\" can't be opened: {1}
zh_cn: 路径：{0} | 错误：{1}

# StatusPathInvalidateWarning
source: There was a problem refreshing \"{0}\": {2}
zh_cn: 路径：{0} | 失效警告（{1}）：{2}

# StatusPathAccessDenied
source: Access to \"{0}\" is denied.
zh_cn: 路径：{0} | 访问被拒绝。

# StatusPathRustError
source: \"{0}\" can't be opened: {2}
zh_cn: 路径：{0} | 错误：Rust 错误 {1}: {2}

# StatusSidebarTreeExpandFailed
source: This location can't be expanded: {0}
zh_cn: 侧边栏树展开失败：{0}

# StatusRenameFailedSelectTreeNode
source: Select an item first.
zh_cn: 重命名失败：请先选择一个树节点。

# StatusSidebarTreeNavIgnoredLoading
source: Please wait until loading finishes.
zh_cn: 侧边栏树导航已忽略：正在加载中。

# StatusSidebarTreeNavFailed
source: This location can't be opened: {0}
zh_cn: 侧边栏树导航失败：{0}

# StatusSidebarNavIgnoredLoading
source: Please wait until loading finishes.
zh_cn: 侧边栏导航已忽略：正在加载中。

# StatusSidebarNavFailed
source: This location can't be opened: {0}
zh_cn: 侧边栏导航失败：{0}

# StatusRenameFailedCouldNotStartInlineEditor
source: This item can't be renamed right now.
zh_cn: 重命名失败：无法启动内联编辑器。

# StatusRenameFailedTreeItemUnavailable
source: This item can't be renamed right now.
zh_cn: 重命名失败：树项目不可用。

# StatusRenameFailedTreeOverlayUnavailable
source: This item can't be renamed right now.
zh_cn: 重命名失败：树重命名浮层不可用。

# StatusRenameFailedTreeTextAnchorUnavailable
source: This item can't be renamed right now.
zh_cn: 重命名失败：树文本锚点不可用。

# StatusOpened
source: Opened: {0}
zh_cn: 已打开：{0}

# StatusOpenFailed
source: This item couldn't be opened: {0}
zh_cn: 打开失败：{0}

# StatusCopyPathReady
source: Copied path: {0}
zh_cn: 已复制路径：{0}

# StatusCopyPathFailed
source: The path couldn't be copied: {0}
zh_cn: 复制路径失败：{0}

# StatusSettingsExported
source: Settings exported: {0}
zh_cn: 设置已导出：{0}

# StatusSettingsExportFailed
source: Settings couldn't be exported: {0}
zh_cn: 导出设置失败：{0}

# StatusSettingsImported
source: Settings imported: {0}
zh_cn: 设置已导入：{0}

# StatusSettingsImportFailed
source: Settings couldn't be imported: {0}
zh_cn: 导入设置失败：{0}

# StatusCreateShortcutSuccess
source: Created shortcut: {0}
zh_cn: 已创建快捷方式：{0}

# StatusCreateShortcutFailed
source: The shortcut couldn't be created: {0}
zh_cn: 创建快捷方式失败：{0}

# StatusOpenTargetFailed
source: The target location couldn't be opened: {0}
zh_cn: 打开目标位置失败：{0}

# StatusRunAsAdministratorStarted
source: Run as administrator started: {0}
zh_cn: 已发起以管理员身份运行：{0}

# StatusRunAsAdministratorFailed
source: This item couldn't be run as administrator: {0}
zh_cn: 以管理员身份运行失败：{0}

# StatusOpenWithOpened
source: Opened with dialog: {0}
zh_cn: 已打开“打开方式”对话框：{0}

# StatusOpenWithFailed
source: The Open with dialog couldn't be shown: {0}
zh_cn: 打开方式失败：{0}

# StatusOpenedInNewWindow
source: Opened in new window: {0}
zh_cn: 已在新窗口中打开：{0}

# StatusOpenInNewWindowFailed
source: This item couldn't be opened in a new window: {0}
zh_cn: 在新窗口中打开失败：{0}

# StatusOpenTerminalSuccess
source: Opened terminal: {0}
zh_cn: 已打开终端：{0}

# StatusOpenTerminalFailed
source: The terminal couldn't be opened: {0}
zh_cn: 打开终端失败：{0}

# StatusPropertiesOpened
source: Opened properties: {0}
zh_cn: 已打开属性：{0}

# StatusPropertiesFailed
source: The properties window couldn't be opened: {0}
zh_cn: 打开属性失败：{0}

# StatusAlreadyAtRoot
source: Already at root.
zh_cn: 已经在根位置。

# StatusRenameSuccess
source: Renamed \"{0}\" to \"{1}\".
zh_cn: 重命名成功：{0} -> {1}

# StatusRenameFailedWithReason
source: This item couldn't be renamed: {0}
zh_cn: 重命名失败：{0}

# StatusDeleteSuccess
source: Deleted \"{0}\".
zh_cn: 删除成功：{0}（递归：{1}）

# StatusDeleteFailedWithReason
source: This item couldn't be deleted: {0}
zh_cn: 删除失败：{0}

# FileTypeGeneric
source: File
zh_cn: 文件

# FileTypeWithExtension
source: {0} File
zh_cn: {0} 文件

# FileTypeFolder
source: Folder
zh_cn: 文件夹

# FileTypeFolderLink
source: Folder link
zh_cn: 文件夹链接

# FileTypeFileLink
source: File link
zh_cn: 文件链接

# DefaultNewFileBaseName
source: New File
zh_cn: 新建文件

# DefaultNewFolderBaseName
source: New Folder
zh_cn: 新建文件夹

# ErrorNameEmpty
source: The name can't be empty.
zh_cn: 名称校验失败：名称为空。

# ErrorNameReserved
source: \"{0}\" can't be used as a name.
zh_cn: 名称校验失败：“{0}”为保留名称。

# ErrorNameInvalidChars
source: \"{0}\" contains characters that can't be used.
zh_cn: 名称校验失败：“{0}”包含非法字符。

# ErrorNameAlreadyExists
source: \"{0}\" already exists in this location.
zh_cn: 名称校验失败：“{0}”已存在。

# ErrorRenameNameEmpty
source: The name can't be empty.
zh_cn: 重命名失败：名称为空。

# ErrorRenameReservedName
source: \"{0}\" can't be used as a name.
zh_cn: 重命名失败：“{0}”为保留名称。

# ErrorRenameInvalidChars
source: \"{0}\" contains characters that can't be used.
zh_cn: 重命名失败：“{0}”包含非法字符。

# ErrorRenameAlreadyExists
source: \"{0}\" already exists in this location.
zh_cn: 重命名失败：“{0}”已存在。

# WindowTitleItemsFormat
source: NorthFile | Engine {0} | Items: {1}
zh_cn: NorthFile | 引擎 {0} | 项目数：{1}

# WindowTitleDrivesFormat
source: NorthFile | Engine {0} | Drives: {1}
zh_cn: NorthFile | 引擎 {0} | 驱动器：{1}

# WindowTitleReadFailedFormat
source: NorthFile | Engine {0} | Read Failed
zh_cn: NorthFile | 引擎 {0} | 读取失败

# DialogRenameTitle
source: Rename
zh_cn: 重命名

# DialogRenamePrimaryButton
source: Rename
zh_cn: 重命名

# DialogDeleteTitle
source: Confirm Delete
zh_cn: 确认删除

# DialogDeleteContent
source: Delete '{0}'? Recursive: {1}
zh_cn: 删除“{0}”？递归删除：{1}

# DialogDeleteFileContent
source: Delete '{0}'?
zh_cn: 删除“{0}”？

# DialogDeleteFolderContent
source: Delete folder '{0}' and its contents?
zh_cn: 删除文件夹“{0}”及其内容？

# DialogDeletePrimaryButton
source: Delete
zh_cn: 删除

# DialogCancelButton
source: Cancel
zh_cn: 取消

# CommonOpenTarget
source: Open Target
zh_cn: 打开目标位置

# CommonPinToSidebar
source: Add to favorites
zh_cn: 添加到收藏

# PinnedGroupTextBlock.Text
source: Favorites
zh_cn: 收藏

# DesktopTextBlock.Text
source: Desktop
zh_cn: 桌面

# DocumentsTextBlock.Text
source: Documents
zh_cn: 文档

# DownloadsTextBlock.Text
source: Downloads
zh_cn: 下载

# PicturesTextBlock.Text
source: Pictures
zh_cn: 图片

# CloudHeaderTextBlock.Text
source: Cloud
zh_cn: 云盘

# NetworkHeaderTextBlock.Text
source: Network
zh_cn: 网络

# TagsHeaderTextBlock.Text
source: Tags
zh_cn: 标签

# TagWorkTextBlock.Text
source: Work
zh_cn: 工作

# TagFocusTextBlock.Text
source: Focus
zh_cn: 重点

# TagArchiveTextBlock.Text
source: Archive
zh_cn: 归档

# SidebarSettingsButtonToolTip.Content
source: Settings
zh_cn: 设置

# UsnCapabilityError
source: Error({0})
zh_cn: 错误({0})

# UsnCapabilityAvailable
source: Available
zh_cn: 可用

# UsnCapabilityNotNtfs
source: Not NTFS
zh_cn: 非 NTFS

# UsnCapabilityDenied
source: Denied
zh_cn: 已拒绝

# UsnCapabilityUnavailable
source: Unavailable
zh_cn: 不可用

# UsnFallbackProbeError
source: (NTFS fallback: probe error {0})
zh_cn: （NTFS 回退：探测错误 {0}）

# UsnFallbackNotLocalNtfs
source: (NTFS fallback: not local NTFS)
zh_cn: （NTFS 回退：非本地 NTFS）

# UsnFallbackAccessDenied
source: (NTFS fallback: access denied)
zh_cn: （NTFS 回退：访问被拒绝）

# UsnFallbackBatchUnavailable
source: (NTFS fallback: probe succeeded, batch path unavailable)
zh_cn: （NTFS 回退：探测成功，但批量路径不可用）

# UsnFallbackUnavailable
source: (NTFS fallback: unavailable)
zh_cn: （NTFS 回退：不可用）

# ErrorPasteSameSourceAndTarget
source: Source and target are the same.
zh_cn: 源路径和目标路径相同。

# ErrorPasteTargetAlreadyExists
source: The target already exists.
zh_cn: 目标项已存在。

# DriveTypeLocalDisk
source: Local Disk
zh_cn: 本地磁盘

# CommonRunAsAdministrator
source: Run as administrator
zh_cn: 以管理员身份运行

# CommonExtract
source: Extract
zh_cn: 解压

# CommonExtractSmart
source: Smart extract
zh_cn: 智能解压

# CommonExtractHere
source: Extract here
zh_cn: 解压到当前位置

# CommonExtractToFolder
source: Extract to folder
zh_cn: 解压到文件夹

# CommonExtractToNamedFolder
source: Extract to {0}
zh_cn: 解压到 {0}

# CommonPreview
source: Preview
zh_cn: 预览

# CommonEmpty
source: (empty)
zh_cn: （空）

# GroupTypeFolder
source: Folders
zh_cn: 文件夹

# GroupTypeDocument
source: Documents
zh_cn: 文档

# GroupTypeImage
source: Images
zh_cn: 图片

# GroupTypeAudio
source: Audio
zh_cn: 音频

# GroupTypeVideo
source: Videos
zh_cn: 视频

# GroupTypeArchive
source: Archives
zh_cn: 压缩包

# GroupTypeProgram
source: Programs
zh_cn: 程序

# GroupTypeOther
source: Other
zh_cn: 其他

# GroupTypeUnknown
source: Unknown
zh_cn: 未知

# GroupDateToday
source: Today
zh_cn: 今天

# GroupDateYesterday
source: Yesterday
zh_cn: 昨天

# GroupDatePast7Days
source: Past 7 days
zh_cn: 过去 7 天

# GroupDateEarlierThisMonth
source: Earlier this month
zh_cn: 本月更早

# GroupDateOlder
source: Older
zh_cn: 更早

# GroupDateUnknown
source: Unknown date
zh_cn: 日期未知

# InteropUnknown
source: unknown
zh_cn: 未知

# InteropUnknownRustFfiError
source: unknown Rust FFI error
zh_cn: 未知 Rust FFI 错误

# InteropNtfsProbeFailed
source: NTFS probe failed ({0})
zh_cn: NTFS 探测失败（{0}）

# InteropMemoryInvalidateDirFailed
source: The memory directory couldn't be refreshed: {0}
zh_cn: 内存目录失效失败：{0}

# InteropMemoryClearCacheFailed
source: The memory cache couldn't be cleared: {0}
zh_cn: 内存缓存清理失败：{0}

# InteropDeletePathFailed
source: Delete path failed ({0}): {1}
zh_cn: 删除路径失败（{0}）：{1}

# InteropRenamePathFailed
source: Rename path failed ({0}): {1}
zh_cn: 重命名路径失败（{0}）：{1}

# InteropRustErrorWithCode
source: Rust error {0}: {1}
zh_cn: Rust 错误 {0}: {1}

# InteropOperationInvalidParameter
source: invalid parameter
zh_cn: 参数无效

# InteropOperationPathNotFound
source: path not found
zh_cn: 路径不存在

# InteropOperationPermissionDenied
source: permission denied
zh_cn: 权限不足

# InteropOperationTargetAlreadyExists
source: target already exists
zh_cn: 目标已存在

# InteropOperationDirectoryNotEmpty
source: directory is not empty
zh_cn: 目录非空

# InteropOperationResourceBusyOrTimedOut
source: resource is busy or timed out
zh_cn: 资源忙或已超时

# InteropOperationInvalidPathOrInput
source: invalid path or input
zh_cn: 路径或输入无效

# InteropOperationNotSupported
source: operation is not supported
zh_cn: 操作不受支持

# InteropOperationGenericIoFailure
source: generic I/O failure
zh_cn: 通用 I/O 失败

# InteropOperationUnknownError
source: unknown error
zh_cn: 未知错误

# ErrorFileOperationNotFound
source: The item could not be found.
zh_cn: 找不到目标项目。

# ErrorFileOperationCanceled
source: The operation was canceled.
zh_cn: 操作已取消。

# ErrorFileOperationAccessDenied
source: Access was denied.
zh_cn: 没有足够权限。

# ErrorFileOperationAlreadyExists
source: The target item already exists.
zh_cn: 目标项目已存在。

# ErrorFileOperationInvalidName
source: The name or path is invalid.
zh_cn: 名称或路径无效。

# ErrorFileOperationPathTooLong
source: The path is too long.
zh_cn: 路径过长。

# ErrorFileOperationInUse
source: The item is currently in use.
zh_cn: 目标项目正被其他程序使用。

# ErrorFileOperationDiskFull
source: There is not enough disk space.
zh_cn: 磁盘空间不足。

# ErrorFileOperationNotSupported
source: This operation is not supported.
zh_cn: 当前操作不受支持。

# ErrorFileOperationInvalidArchive
source: The archive is invalid or corrupted.
zh_cn: 压缩包无效或已损坏。

# ErrorFileOperationUnknown
source: An unknown file operation error occurred.
zh_cn: 发生了未知的文件操作错误。

# StatusShareOpened
source: The Share window is ready.
zh_cn: 已打开分享窗口：{0}

# StatusShareFailed
source: This item couldn't be shared: {0}
zh_cn: 分享失败：{0}

# StatusCompressZipSuccess
source: Created the archive \"{0}\".
zh_cn: 已创建 ZIP 压缩包：{0}

# StatusCompressZipFailed
source: The ZIP archive couldn't be created: {0}
zh_cn: 创建 ZIP 压缩包失败：{0}

# StatusExtractZipSuccess
source: Extracted \"{0}\".
zh_cn: 已解压 ZIP 压缩包：{0}

# StatusExtractZipFailed
source: The ZIP archive couldn't be extracted: {0}
zh_cn: 解压 ZIP 压缩包失败：{0}

# SettingsPageTitle
source: Settings
zh_cn: 设置

# SettingsNavBack
source: Back
zh_cn: 返回

# SettingsSectionGeneral
source: General
zh_cn: 通用

# SettingsSectionGeneralDescription
source: Basic app behavior and startup options.
zh_cn: 基础应用行为和启动方式。

# SettingsLanguageTitle
source: Language
zh_cn: 语言

# SettingsLanguageDescription
source: Controls the display language. Choose the system setting or a specific language.
zh_cn: 应用显示语言，可选择跟随系统或手动指定。

# SettingsUseSystem
source: Use system setting
zh_cn: 使用系统设置

# SettingsStartupTitle
source: Startup
zh_cn: 启动设置

# SettingsStartupDescription
source: Controls the default location after launch.
zh_cn: 应用启动后默认进入的位置。

# SettingsStartupLastLocation
source: Last closed location
zh_cn: 上次关闭位置

# SettingsStartupSpecifiedLocation
source: Specified location
zh_cn: 指定位置

# SettingsStartupSpecifiedPathTitle
source: Startup folder
zh_cn: 启动文件夹

# SettingsStartupSpecifiedPathDescription
source: Choose the folder to open at launch when specified location is selected.
zh_cn: 当启动位置选择为指定位置时，打开这里设置的文件夹。

# SettingsStartupSpecifiedPathPlaceholder
source: Enter a folder path
zh_cn: 输入文件夹路径

# SettingsBrowseFolder
source: Browse
zh_cn: 浏览

# SettingsStartupUseThisPc
source: This PC
zh_cn: 此电脑

# SettingsStartupUseCustomPath
source: Custom path
zh_cn: 自定义路径

# SettingsFavoritesTitle
source: Favorites
zh_cn: 收藏

# SettingsFavoritesDescription
source: Controls whether the favorites group is shown.
zh_cn: 控制收藏分组是否显示。

# SettingsCloudTitle
source: Cloud drives
zh_cn: 云盘

# SettingsCloudDescription
source: Controls whether the cloud drives group is shown in the sidebar.
zh_cn: 控制侧边栏中的云盘分组是否显示。

# SettingsNetworkTitle
source: Network
zh_cn: 网络

# SettingsNetworkDescription
source: Controls whether the network group is shown in the sidebar.
zh_cn: 控制侧边栏中的网络分组是否显示。

# SettingsTagsTitle
source: Tags
zh_cn: 标签

# SettingsTagsDescription
source: Controls whether the tags group is shown in the sidebar.
zh_cn: 控制侧边栏中的标签分组是否显示。

# SettingsSectionAppearance
source: Appearance
zh_cn: 外观

# SettingsSectionAppearanceDescription
source: App theme and default presentation.
zh_cn: 应用主题和默认展示方式。

# SettingsThemeTitle
source: Theme
zh_cn: 主题

# SettingsThemeDescription
source: Controls the light, dark, or system theme for NorthFile.
zh_cn: 控制 NorthFile 的浅色、深色或跟随系统外观。

# SettingsThemeLight
source: Light
zh_cn: 浅色

# SettingsThemeDark
source: Dark
zh_cn: 深色

# SettingsSortTitle
source: Default sort mode
zh_cn: 默认排序方式

# SettingsSortDescription
source: Controls the default sort used by new windows.
zh_cn: 为新窗口准备的默认排序方式。

# SettingsGroupTitle
source: Default group mode
zh_cn: 默认分组方式

# SettingsGroupDescription
source: Controls the initial grouping state when entering a folder.
zh_cn: 控制新窗口进入目录时的初始分组状态。

# SettingsSectionFilesAndFolders
source: Files and folders
zh_cn: 文件和文件夹
